{
    "title": "Poison Study",
    "storyline": "Not everyone is pleased by Yelena's acceptance of the role of food taster, especially not General Brazell, whose son was killed by Yelena, despite it being in self-defense. His wants for her death causes Valek, the assassin and right-hand man to the Commander, who rules Ixia with an iron fist without ever bending the rules, to take her under his protection, despite having fed her Butterfly Dust to prevent her escape: if she doesn't have the antidote every day, she will die. But unfortunately for Yelena, she is developing strong magical abilities that she cannot control, which are illegal and a cause for death in Ixia. But she must use her abilities to protect herself not only from other magic users coming into Ixia, but against those who plot against the commander and against Valek, who she is slowly developing feelings for. In the end, she and Valek discover that General Brazell and a rogue magician from Sitia are behind the plot, as well as the kidnapping of many children from Sitia, including Yelena, for their magical abilities. The magician has stolen the souls and magic of many of the young children, and has opened the Commander's mind to magical influence. Yelena and Valek defeat him and capture Brazell, but the Commander's mind has fled and it is up Yelena and her magic to find it. She discovers that the Commander was born a woman and promises to keep that secret. But for her use of magic in the inflexible land of Ixia, she must be put to death. Valek delays the death order long enough to let her and other stolen children return to the south lands.",
    "authors": ["Maria V. Snyder"],
    "genres": [
      "fiction",
      "fantasy"
    ],
    "characters": [
        "Yelena",
        "Valek",
        "Commander Ambrose",
        "Ari",
        "Janco",
        "Rand",
        "General Brazell",
        "Reyad "
    ],
    "pages": 361,
    "ISBN": "0373802307",
    "language": "english",
    "publisher": "Luna books",
    "publication_date": "2005-09-27"
  }
